ApacheBench-ab/data/ab_init_4.log
This is ApacheBench, Version 2.3 <$Revision$>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.176.22.211 (be patient).....done


Server Software:        nginx/1.8.1
Server Hostname:        10.176.22.211
Server Port:            80

Document Path:          
                       /VOD4K/Test_track17.8.mp4
                       /VOD4K/Test_track18.8.mp4
                       /VOD4K/Test_track19.8.mp4
                       /VOD4K/Test_track20.8.mp4
                       /VOD4K/Test_track29.8.mp4
                       /VOD4K/Test_track30.8.mp4
                       /VOD4K/Test_track31.8.mp4
                       /VOD4K/Test_track32.8.mp4
                       /VOD4K/Test_track41.8.mp4
                       /VOD4K/Test_track42.8.mp4
                       /VOD4K/Test_track43.8.mp4
                       /VOD4K/Test_track44.8.mp4
                       /VOD4K/Test_track53.8.mp4
                       /VOD4K/Test_track54.8.mp4
                       /VOD4K/Test_track55.8.mp4
                       /VOD4K/Test_track56.8.mp4
                       /VOD4K/Test_track73.8.mp4
                       /VOD4K/Test_track74.8.mp4
                       /VOD4K/Test_track75.8.mp4
                       /VOD4K/Test_track76.8.mp4
Document Length:        1839684 bytes

Concurrency Level:      4
Time taken for tests:   0.006 seconds, 5801.000000 us
Complete requests:      4
Failed requests:        0
Write errors:           0
Keep-Alive requests:    4
Total transferred:      1858852 bytes
HTML transferred:       1839684 bytes
Requests per second:    689.54 [#/sec] (mean)
Time per request:       5.801 [ms] (mean)
Time per request:       1.450 [ms] (mean, across all concurrent requests)
Transfer rate:          312926.25 [Kbytes/sec] received
connect:226, process:4895, wait:3534, total:5121, transfer:1361
connect:218, process:5188, wait:3822, total:5406, transfer:1366
connect:223, process:5205, wait:3536, total:5428, transfer:1669
connect:213, process:5423, wait:3980, total:5636, transfer:1443
@MEASUREMENT(requests = 1, concurrency = 4):
AVERAGE = 4895.00 us
50 TAIL = 4895.00 us
99 TAIL = 4895.00 us
99.9 TAIL = 4895.00 us
99.99 TAIL = 4895.00 us
@MEASUREMENT(requests = 1, concurrency = 4):
AVERAGE = 5205.00 us
50 TAIL = 5205.00 us
99 TAIL = 5205.00 us
99.9 TAIL = 5205.00 us
99.99 TAIL = 5205.00 us
@MEASUREMENT(requests = 1, concurrency = 4):
AVERAGE = 5188.00 us
50 TAIL = 5188.00 us
99 TAIL = 5188.00 us
99.9 TAIL = 5188.00 us
99.99 TAIL = 5188.00 us
@MEASUREMENT(requests = 1, concurrency = 4):
AVERAGE = 5423.00 us
50 TAIL = 5423.00 us
99 TAIL = 5423.00 us
99.9 TAIL = 5423.00 us
99.99 TAIL = 5423.00 us

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      213  220   0.0    223     226
Processing:  4895 5177   0.2   5205    5423
Waiting:     3534 3718   0.2   3822    3980
Total:       5121 5397   0.2   5428    5636
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the processing time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the waiting time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the total time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      6
  80%      6
  90%      6
  95%      6
  98%      6
  99%      6
 100%      6 (longest request)